〇モード
i / a -直前 / 直後からインサート
I / A -行頭 / 行末からインサート
O / o -上 / 下改行 + インサート
v -ビジュアル
Ctrl + v -短径選択のビジュアル
Ctrl + c -ノーマル
Ctrl + z -vimを一時停止

〇ビジュアル
y -コピー
d -削除
移動系 -移動しながら範囲選択
i -インサート

〇画面
zt -カーソルが画面上部になるようにスクロールt
zz -カーソルが画面中央になるようにスクロール
Ctrl + u -半画面上
Ctrl + d -半画面下

〇行移動
gg -1行目に移動
G -最終行に移動
xxG -xx行目に移動 H -画面上の最初の行
M -画面上の中央の行
L -画面上の最終行

〇細かい移動
w -次の単語
b -前の単語
0 -行頭
$ -行末
% -対応するカッコに移動

〇操作系(vs code自体の昨日)
Ctrl + Enter -カーソル下に空行
Alt + ↑↓ -カーソル行をそのまま移動

〇削除
diw -単語を削除
ciw -単語を削除 + インサート
di" -""内部を削除
ci" -""内部を削除 + インサート
x -1文字削除
S -行を削除してインサート
D -ここから行末まで削除
C -ここから行末まで削除 + インサート

〇コピペ、選択
yy -行をコピー
yi" -""内部をコピー
xxyl -xx文字コピー
p -カーソルの場所にペースト
xxp -xx回ペースト
gv -直前の範囲を選択

〇検索
/xx -xxを検索
# / * -カーソル上の単語検索(上 / 下)
N / n -前 / 後の検索結果

〇編集
. -直前の変更を繰り返す
u -Undo
Ctrl + r -Redo
:%s/xxx/yyy/g -ファイル全体のxxxをyyyに置換

〇終了、作成
:wq -保存
:q! -保存しない
:e xxx -xxxという名前のファイルを作成








・wsl2

・研修

・基本情報

・SQL
